{"cover_image":"media/golang-as-javascripter--cover-image.jpg","title":"Trying Golang as a JavaScript lover","date":"2021-08-14T18:30:00.000Z","description":"I have written JavaScript, TypeScript, Dart, Python, PHP, C, C++, but never tried golang before. Here is my first hand experience trying it out","body":"<p><img src=\"\" alt=\"Peaceful Tibetan Monastery\" style=\"display: none;\"></p><div class=\"picture-container\">\n  <figure style=\"width: 100%;--padding-top: 66.91666666666667%;\">\n    <picture>\n      <source type=\"image/jpg\" media=\"(min-width: 501px)\" data-srcset=\"../media/golang-as-javascripter--cover-image/large.jpg\">\n      <source type=\"image/jpg\" media=\"(max-width: 500px)\" data-srcset=\"../media/golang-as-javascripter--cover-image/small.jpg\">\n      <img alt=\"Peaceful Tibetan Monastery\" data-src=\"../media/golang-as-javascripter--cover-image/large.jpg\" class=\"lazyload blog-img\">\n    </picture>\n  </figure>\n  </div><p></p>\n<p>I have been into coding since early 2015. That's about 6 years now. In that time I have done HTML CSS JavaScript, it's supersets TypeScript(My most favorite language of all time <img class=\"emoji\" draggable=\"false\" alt=\"ðŸ˜Œ\" src=\"https://twemoji.maxcdn.com/v/13.1.0/svg/1f60c.svg\">) and Dart, Python as a form of timepass, and C and C++ in university curriculum.</p>\n<p>Recently, Golang caught my eye. So I had been casually reading its documentation, the tutorial, some articles. Not really trying it out, in the sense opening VSCode and writing the code. That didn't happen.</p>\n<p>I was just trying to get a feel for the patterns. Because the more sources you learn from, the better you become, no matter if the context is entirely different. Concepts and Patterns bleed over to other things.</p>\n<p>Now here's one thing about me: I am a die-hard JavaScripter(That's not an official term, but who cares, let's consider it is, for now <img class=\"emoji\" draggable=\"false\" alt=\"ðŸ˜‹\" src=\"https://twemoji.maxcdn.com/v/13.1.0/svg/1f60b.svg\">). I write everything in JavaScript or TypeScript(Basically JavaScript with Types and futuristic features). Whether it's an app, or a small script or heck, even something where using Python\nwould be better, I still go with JavaScript.</p>\n<p>Why? Because JavaScript is extremely flexible. As a language alone, it can literally do <strong>anything</strong>. It is a very simple language. There are a dozen ways to do anything in it. Then you include the <strong>Modular</strong> aspect of it in the equation, like <a href=\"https://www.npmjs.com/\" target=\"_blank\" rel=\"noopener\">NPM</a>, and JavaScript reaches a godly level.</p>\n<p>Yet at the same time, it is explicit enough. You have to declare variable first before using it using <code>const</code> or <code>let</code>, unlike Python, which leads to confusion about <strong>where</strong> the variable is coming from!!</p>\n<p>JavaScript uses curly braces for blocks instead of indentation. People would say Python looks cleaner without those braces, and I agree. It <strong>looks</strong> cleaner. But while reading, that indentation confuses me, as in, the line I'm reading belongs to which block exactly. Plus writing it is really risky. You might end up accidentally removing indentation from a line at the end of a block and it becomes a part of the outer block. It <strong>has happened to me</strong>, countless times.</p>\n<p>These are some reasons why JavaScript is my favorite. So where does Go factor in on it?</p>\n<p>Let's see!</p>\n<h1 id=\"TLDR\"><a class=\"heading-link\" href=\"#TLDR\">#</a>TLDR</h1>\n<p>Sorry, there's no TLDR for this article. It's just a documentation of my experience <img class=\"emoji\" draggable=\"false\" alt=\"ðŸ¥²\" src=\"https://twemoji.maxcdn.com/v/13.1.0/svg/1f972.svg\">.</p>\n<h1 id=\"Disclaimer\"><a class=\"heading-link\" href=\"#Disclaimer\">#</a>Disclaimer</h1>\n<p>Before we start, here's something I wanna make clear: This isn't an organized technical article about pros and cons of Go or JavaScript. This is a completely Subjective article about what <strong>I like</strong> about Go and what I don't like about it.</p>\n<p>If yur here for a hardcore, informative article about Go and JavaScript, I might disappoint you <img class=\"emoji\" draggable=\"false\" alt=\"ðŸ˜…\" src=\"https://twemoji.maxcdn.com/v/13.1.0/svg/1f605.svg\">.</p>\n<p>But hey, if you wanna read first hand experience, this is it!! Read on!! <img class=\"emoji\" draggable=\"false\" alt=\"ðŸ¤©\" src=\"https://twemoji.maxcdn.com/v/13.1.0/svg/1f929.svg\"></p>\n<p>So with that out of the way, let's begin!</p>\n<h1 id=\"Why-even-try-Go\"><a class=\"heading-link\" href=\"#Why-even-try-Go\">#</a>Why even try Go?</h1>\n<p>This is a valid question. You saw I know many languages, and even on top of that, I use JavaScript for everything. So what gives? Why try to fit another language in my tiny brain?</p>\n<p>The problem was when JS was way too big!!</p>\n<p>What do I mean by that? Let's rewind a little!!</p>\n<h1 id=\"The-lazy-undergraduate\"><a class=\"heading-link\" href=\"#The-lazy-undergraduate\">#</a>The lazy undergraduate</h1>\n<p>I am the lazy undergraduate in question <img class=\"emoji\" draggable=\"false\" alt=\"ðŸ˜„\" src=\"https://twemoji.maxcdn.com/v/13.1.0/svg/1f604.svg\">.</p>\n<p>I took admission in university a few months back. Thanks to Covid-19, our classes are fully online. It means there are a bunch of Google meet links that I had to hunt for every class.</p>\n<p>So the actual process was:</p>\n<ol>\n<li>Open up the timetable every hour and see which class is next.</li>\n<li>If there's a class in next hour, find out its link.</li>\n</ol>\n<p>Believe me or not, this process took 5 minutes. EVERY. SINGLE. TIME! 5 minutes isn't a lot, but you count these 5 minutes for every time I had to it, and combine it, that's around 10 hours wasted just for finding the link.</p>\n<p>And worse than that is the repetition. As a programmer, you know how horrible it is do the same boring task again and again. And unlike non-programmers, you can't accept the situation and get used to it. You have to automate it, even if it takes hours.</p>\n<p>So hey, that's what I did!!</p>\n<p>I created a script that would run in the background, and open the class link in the browser 5 minutes before the class started. Just like that!!</p>\n<h1 id=\"In-comes-Deno\"><a class=\"heading-link\" href=\"#In-comes-Deno\">#</a>In comes Deno</h1>\n<p><img src=\"\" alt=\"Hold up a minute meme\" style=\"display: none;\"></p><div class=\"picture-container\">\n  <figure style=\"width: 100%;--padding-top: 100%;\">\n    <picture>\n      <source type=\"image/jpg\" media=\"(min-width: 501px)\" data-srcset=\"../media/golang-as-javascripter--hold-up/large.jpg\">\n      <source type=\"image/jpg\" media=\"(max-width: 500px)\" data-srcset=\"../media/golang-as-javascripter--hold-up/small.jpg\">\n      <img alt=\"Hold up a minute meme\" data-src=\"../media/golang-as-javascripter--hold-up/large.jpg\" class=\"lazyload blog-img\">\n    </picture>\n  </figure>\n  </div><p></p>\n<p>If you're like, \"Hold up a minute, what's Deno doing an article about Go?\", lemme explain.</p>\n<p>Deno is platform for JavaScript/typeScript, like NodeJS, with the added benefit of compiling your code into machine level code, or an executable file.</p>\n<p>This was perfect for me. I could write code in my favorite language, and convert it over to an executable that I could configure to run on System startup, so I'd never have to run it myself ever again.</p>\n<p><img src=\"\" alt=\"Perfection meme from X Men\" style=\"display: none;\"></p><div class=\"picture-container\">\n  <div class=\"gif-vid-container\">\n    <video autoplay=\"\" loop=\"\" muted=\"\" playsinline=\"\">\n      <source src=\"../media/golang-as-javascripter--xmen-perfection-meme/vidgif.mp4\" type=\"video/mp4\">\n      Your browser doesn't support HTML5 video playback. <a href=\"../media/golang-as-javascripter--xmen-perfection-meme.gif\" target=\"_blank\" rel=\"noopener\">See the gif here</a>\n    </video>\n  </div>\n  </div><p></p>\n<p>Only it wasn't perfect <img class=\"emoji\" draggable=\"false\" alt=\"ðŸ¤\" src=\"https://twemoji.maxcdn.com/v/13.1.0/svg/1f910.svg\"><img class=\"emoji\" draggable=\"false\" alt=\"ðŸ¤\" src=\"https://twemoji.maxcdn.com/v/13.1.0/svg/1f910.svg\">.</p>\n<p>The code itself was amazingly easy to write. I completed it in 3 hours, because I was so familiar with TypeScript.</p>\n<p>But where the issue was while compiling the code into an executable.</p>\n<p>The executable's size was <mark>56 MB</mark> for windows, and as high as <mark>90MB</mark> for MacOS M1.</p>\n<p>56Mb isn't a lot for me. Even 90 MB is nothing. But it kept nagging at me. I try to keep the sizes of apps/websites as low as I can, and 56MB felt just way too big for that.</p>\n<p>And not only that. Because I had made this project public(Here it is: [github.com/PuruVJ/auto-class-launcher-deno]) and usable for everyone, my batchmates tried to use it, and well, 60-90Mb was way too big for them, due to limited internet and all.</p>\n<p>So I got a good excuse to re-write it.</p>\n<p>Node was out of question because any script in it would require NodeJS to be installed on the system and overall a more complicated process.</p>\n<p>I turned towards Rust! I had been jumping to learn Rust for quite some time, cuz of its performance and modernity and all that stuff.</p>\n<p>But oh boy, Rust was hard. Extremely hard!! I gave up after a few hours.</p>\n<p>Then, I finally turned towards Go!!</p>\n<p>I sat down at night to make it. I created the project, initialized the Go</p>\n","id":"golang-as-javascripter","reading_time":2.965,"toc":[{"indent":0,"id":"TLDR","title":"TLDR","length":4},{"indent":0,"id":"Disclaimer","title":"Disclaimer","length":10},{"indent":0,"id":"Why-even-try-Go","title":"Why even try Go?","length":16},{"indent":0,"id":"The-lazy-undergraduate","title":"The lazy undergraduate","length":22},{"indent":0,"id":"In-comes-Deno","title":"In comes Deno","length":13}],"seriesIndex":0}