{"cover_image":"../media/blog-social-intro.png","title":"Near-native TypeScript in NodeJS","date":"2021-07-25T18:30:00.000Z","description":"It's hard to get TypeScript working in NodeJS. You got tons of config to set up, and it can get irritating with the build times.","body":"<p>Have you worked with NodeJS in past? Have you tried to add TypeScript to the project, and realized how bad the Developer Experience suddenly becomes?</p>\n<p>Sure, you have the great DX that <strong>writing TypeScript code</strong> provides, but get lost into the rabbit hole, that is to make sure the various build tools you pull in play nicely with each other &amp; provide the correct output you want.</p>\n<p>If it's a web based project, you don't need to worry at all. <a href=\"https://reactjs.org/docs/create-a-new-react-app.html\" target=\"_blank\" rel=\"noopener\">Create React App</a>, <a href=\"https://vitejs.dev/\" target=\"_blank\" rel=\"noopener\">Vite</a>, <a href=\"https://www.snowpack.dev/\" target=\"_blank\" rel=\"noopener\">Snowpack</a> and many such build-and-server tools have got your back and work seamlessly.</p>\n<p>But for browser, it isn't as big of an issue adding all these tools, because</p>\n<ul>\n<li>They provide <strong>marvelous</strong> Developer Experience, from setup to starting server to building the final app</li>\n<li>It's expected on the web. You always need to have a web server running in the background, so integrating some extra build tools in the same process doesn't really hurt.</li>\n</ul>\n<p>But for NodeJS, it's a whole <strong>new</strong> story. Writing code for NodeJS at its very base is just writing a JS file, and executing it via <code>node index.js</code>. That's how it's been since the beginning.</p>\n<p>So, to visualize this whole pain, let's introduce a character to the story: <strong>Maahi</strong>. Maahi is a frontend web developer, and now she's trying to get into writing NodeJS code. She thinks: <strong>Easy peasy, it's just JavaScript, how different it can be!</strong>. And that is true, after 2 weeks of reading article after article, she cracks NodeJS development enough to be able to write full fledges programs in it.</p>\n<p>But after just 2 weeks, she's already heartsick for her most favorite part of programming: <strong>TypeScript</strong>. She had been very disciplined and focused, and focused only on raw NodeJS-edition of JavaScript.</p>\n<p>So she searches on Google \"TypeScript with NodeJS\". She looks, and finds this out <img class=\"emoji\" draggable=\"false\" alt=\"👇\" src=\"https://twemoji.maxcdn.com/v/13.1.0/svg/1f447.svg\"></p>\n<pre class=\"shiki\" style=\"background-color: #292D3E\"><code><span class=\"line\"><span style=\"color: #A6ACCD\">tsc</span></span>\n<span class=\"line\"><span style=\"color: #A6ACCD\">node index.js</span></span>\n<span class=\"line\"></span></code></pre>\n<blockquote>\n<p>Let's just skip over the whole crazy getting-tsconfig-right song and dance, that's out of scope of this article. Let's just assume the entrypoint files are specified, and outputted as one single <code>index.js</code> file</p>\n</blockquote>\n<p>So now she can just write TypeScript and it will just work!!! All she needs to do is <code>tsc &amp;&amp; node index.js</code> everytime she wants to run the script, and bam!! It just works!! There's a sparkle in her eyes, writing her favorite language!! She just can't get enough of this awesomeness <img class=\"emoji\" draggable=\"false\" alt=\"😌\" src=\"https://twemoji.maxcdn.com/v/13.1.0/svg/1f60c.svg\">.</p>\n<p>But the sparkle is gone very soon. Why? Cuz this <code>tsc &amp;&amp; node index.js</code> command is slow. Excruciatingly slow!!! She enters this command everytime, and then has to wait for seconds, literally, to have the code run. Soon she is just irritated at the speed.</p>\n<p>She thinks, \"It wasn't so irritating doing web dev with local server and all.\"</p>\n<p>Her conscience replies back, \"Off course dummy, the setup there is superb, and very smart, the moment you change your code, it recompiles everything! It's a watcher!!!\"</p>\n<p>Her eyes flew open!!! How did she not think of putting a code watcher here.</p>\n<p>She scrambles for her keyboard, types \"TypeScript watch code\" in the search box, and instantly find a super simple flag: <code>--watch</code>.</p>\n<p><img src=\"\" alt=\"Running tsc --watch in split terminals\" style=\"display: none;\"></p><div class=\"picture-container\">\n  <figure style=\"width: 100%;--padding-top: 56.25%;\">\n    <picture>\n      <source type=\"image/png\" media=\"(min-width: 501px)\" data-srcset=\"../media/native-ts-in-node--split-terminals-tsc-watch/large.png\">\n      <source type=\"image/png\" media=\"(max-width: 500px)\" data-srcset=\"../media/native-ts-in-node--split-terminals-tsc-watch/small.png\">\n      <img alt=\"Running tsc --watch in split terminals\" data-src=\"../media/native-ts-in-node--split-terminals-tsc-watch/large.png\" class=\"lazyload blog-img\">\n    </picture>\n  </figure>\n  </div><p></p>\n<p>She is instantly delighted!! She opens up split terminals, and type <code>tsc -- watch</code> in one, and <code>node index.js</code> in other terminal whenever she wishes to run the code. She doesn't have to wait for it to compile anymore, as it's compiling in real time in background. It feels as if she's writing TypeScript, and it is running almost natively!! She's really happy with it</p>\n<h2 id=\"A-week-passes-by...\"><a class=\"heading-link\" href=\"#A-week-passes-by...\">#</a>A week passes by...</h2>\n<p>A week has passed by. She's pretty happy with her setup. Just start the <code>tsc --watch</code> command, open another terminal and execute node there. Life's good.</p>\n<p>Then one day, she comes in to work, starts writing the code and running <code>node index.js</code> as usual. She notices it isn't working. Whatever code she wrote, it doesn't seem to be working. She puts <code>console.log</code> every ten lines, every file, every conditional and keeps checking. She's on the verge of pulling her hair out, but then she opens the generated <code>index.js</code> to inspect what is happening. There, she finds, all the code she wrote today isn't even there. None of the logic, no <code>console.log</code>s she added.</p>\n<p>The revelation hits her hard, and she reciprocates the favor by hitting her head repeatedly.</p>\n<p>She realized she hadn't started the <code>tsc --watch</code> command today. So technically, her code wasn't compiled to the output, the output folder still had code from previous day.</p>\n<p>The sweet spot she had been with this approach is now fading away. After that debacle, she doesn't like this approach anymore. She admits it's a human mistake, anyone can do it, but she still seethes inside. The way this whole <strong>running-the-program-in-command-line</strong> works, makes starting a watcher feel unnatural.</p>\n<p>She's even considering dropping TypeScript now. Which alone is quite tragic. Even if uses the <a href=\"https://www.puruvj.dev/blog/get-to-know-typescript--using-typescript-without-typescript\" target=\"_blank\" rel=\"noopener\">JSDoc sugar to get TypeScript like features working in JavaScript</a>, it still isn't as good a an experience as writing TypeScript directly is.</p>\n<p>So she's just browsing twitter, reading web development news. She suddenly comes across this new tool called <a href=\"https://github.com/antfu/esno\" target=\"_blank\" rel=\"noopener\">esno</a>. She opened it up, saw the docs, and her eyes flew wide open!!</p>\n<p><img src=\"\" alt=\"Eyes wide open; cat\" style=\"display: none;\"></p><div class=\"picture-container\">\n  <div class=\"gif-vid-container\">\n    <video autoplay=\"\" loop=\"\" muted=\"\" playsinline=\"\">\n      <source src=\"../media/native-ts-in-node--eyes-wide-open-cat/vidgif.mp4\" type=\"video/mp4\">\n      Your browser doesn't support HTML5 video playback. <a href=\"../media/native-ts-in-node--eyes-wide-open-cat.gif\" target=\"_blank\" rel=\"noopener\">See the gif here</a>\n    </video>\n  </div>\n  </div><p></p>\n","id":"near-native-typescript-in-node","reading_time":2.4425,"toc":[{"indent":1,"id":"A-week-passes-by...","title":"A week passes by...","length":19}],"seriesIndex":0}